РасчетныеЗадачиЗанятие5/src/Documents/КадровоеИзменение/КадровоеИзменение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КадровоеИзменение</name>
  <basedOn>Document.ПриказОПриеме</basedOn>
  <basedOn>Document.КадровоеИзменение</basedOn>
  <registerRecords>InformationRegister.ПлановыеНачисления</registerRecords>
  <registerRecords>InformationRegister.Сотрудники</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержания</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриказОПриеме</types>
      <types>DocumentRef.КадровоеИзменение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РасчетныеЗадачиЗанятие5/src/Documents/КадровоеИзменение/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриказОПриеме") Тогда

		ДокументОснование = ДанныеЗаполнения;
		ГрафикРаботы = ДанныеЗаполнения.ГрафикРаботы;
		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ФизическоеЛицо = ДанныеЗаполнения.ФизическоеЛицо;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КадровоеИзменение") Тогда

		ДокументОснование = ДанныеЗаполнения;
		ГрафикРаботы = ДанныеЗаполнения.ГрафикРаботы;
		Должность = ДанныеЗаполнения.Должность;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ФизическоеЛицо = ДанныеЗаполнения.ФизическоеЛицо;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьНаличиеОдногоНачисленияЗачетОтработанногоВремени(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлановыеОсновныеНачисленияСрезПоследних.ВидРасчета
	|ПОМЕСТИТЬ ВТОсновныеНачисления
	|ИЗ
	|	РегистрСведений.ПлановыеОсновныеНачисления.СрезПоследних(&Период, ФизическоеЛицо = &ФизическоеЛицо) КАК ПлановыеОсновныеНачисленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВТОсновныеНачисления.ВидРасчета) КАК ВидРасчета 
	|ИЗ
	|	ВТОсновныеНачисления КАК ВТОсновныеНачисления
	|ГДЕ
	|	ВТОсновныеНачисления.ВидРасчета.ЗачетОтработанногоВремени = ИСТИНА";
	
	Запрос.УстановитьПараметр("Период",ДатаСобытия);
	Запрос.УстановитьПараметр("ФизическоеЛицо",ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ВыборкаДетальныеЗаписи.ВидРасчета > 1 Тогда
			
			Отказ = Истина;
			
			Сообщить("Для сотрудника можно указать только одно начисления, учитывающее отработанное время!");
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидРасчета = 0 Тогда
			
			Отказ = Истина;
			
			Сообщить("Для сотрудника нужно указать одно начисления, учитывающее отработанное время!");
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
